._design_docs/.test_reports/mtp-jinja-run-20260607-V1/S12-MTP-B06-V1-Jmarked/legacy/k6-stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: D:\source\llama.cpp-jet\tools\server\tests\bench-cache-correctness.js
        output: json (D:\source\llama.cpp-jet\._design_docs\.test_reports\mtp-jinja-run-20260607-V1\S12-MTP-B06-V1-Jmarked\legacy\k6-results.json)

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 5m30s max duration (incl. graceful stop):
              * hit_probe: 23 iterations shared among 1 VUs (maxDuration: 5m0s, exec: doProbe, gracefulStop: 30s)
              * warmup: 1 iterations shared among 1 VUs (maxDuration: 2m0s, exec: doWarmup, gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 1 complete and 0 interrupted iterations
hit_probe   [   4% ] 1 VUs  0m01.0s/5m0s  01/23 shared iters
warmup      [   0% ] 1 VUs  0m01.0s/2m0s  0/1 shared iters

running (0m02.0s), 1/2 VUs, 2 complete and 0 interrupted iterations
hit_probe   [   4% ] 1 VUs  0m02.0s/5m0s  01/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m03.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
hit_probe   [  13% ] 1 VUs  0m03.0s/5m0s  03/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m04.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
hit_probe   [  17% ] 1 VUs  0m04.0s/5m0s  04/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m05.0s), 1/2 VUs, 6 complete and 0 interrupted iterations
hit_probe   [  22% ] 1 VUs  0m05.0s/5m0s  05/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m06.0s), 1/2 VUs, 8 complete and 0 interrupted iterations
hit_probe   [  30% ] 1 VUs  0m06.0s/5m0s  07/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m07.0s), 1/2 VUs, 9 complete and 0 interrupted iterations
hit_probe   [  35% ] 1 VUs  0m07.0s/5m0s  08/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m08.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
hit_probe   [  39% ] 1 VUs  0m08.0s/5m0s  09/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m09.0s), 1/2 VUs, 12 complete and 0 interrupted iterations
hit_probe   [  48% ] 1 VUs  0m09.0s/5m0s  11/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m10.0s), 1/2 VUs, 13 complete and 0 interrupted iterations
hit_probe   [  52% ] 1 VUs  0m10.0s/5m0s  12/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m11.0s), 1/2 VUs, 14 complete and 0 interrupted iterations
hit_probe   [  57% ] 1 VUs  0m11.0s/5m0s  13/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m12.0s), 1/2 VUs, 16 complete and 0 interrupted iterations
hit_probe   [  65% ] 1 VUs  0m12.0s/5m0s  15/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m13.0s), 1/2 VUs, 17 complete and 0 interrupted iterations
hit_probe   [  70% ] 1 VUs  0m13.0s/5m0s  16/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m14.0s), 1/2 VUs, 18 complete and 0 interrupted iterations
hit_probe   [  74% ] 1 VUs  0m14.0s/5m0s  17/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m15.0s), 1/2 VUs, 20 complete and 0 interrupted iterations
hit_probe   [  83% ] 1 VUs  0m15.0s/5m0s  19/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m16.0s), 1/2 VUs, 21 complete and 0 interrupted iterations
hit_probe   [  87% ] 1 VUs  0m16.0s/5m0s  20/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters

running (0m17.0s), 1/2 VUs, 22 complete and 0 interrupted iterations
hit_probe   [  91% ] 1 VUs  0m17.0s/5m0s  21/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters


  █ THRESHOLDS 

    cache_hit_rate
    ✓ 'rate>=0.0' rate=91.30%

    http_req_failed
    ✗ 'rate<0.01' rate=4.16%

    prefix_match_rate
    ✓ 'rate>=0.95' rate=95.65%


  █ TOTAL RESULTS 

    checks_total.......: 24     1.385058/s
    checks_succeeded...: 95.83% 23 out of 24
    checks_failed......: 4.16%  1 out of 24

    ✗ probe 200
      ↳  95% — ✓ 22 / ✗ 1
    ✓ warmup 200

    CUSTOM
    cache_hit_prompt_ms............: avg=225.97ms min=216.25ms med=221.99ms p(95)=233.05ms max=298.24ms
    cache_hit_rate.................: 91.30% 21 out of 23
    cache_miss_prompt_ms...........: avg=251.27ms min=225.67ms med=251.27ms p(95)=274.32ms max=276.88ms
    cache_n_tokens.................: avg=0.956522 min=0        med=1        p(95)=1        max=1       
    prefix_match_rate..............: 95.65% 22 out of 23
    requests_ok....................: 23     1.327347/s

    HTTP
    http_req_duration..............: avg=687.03ms min=0s       med=650.48ms p(95)=1.16s    max=1.37s   
      { expected_response:true }...: avg=716.9ms  min=635.18ms med=650.95ms p(95)=1.17s    max=1.37s   
    http_req_failed................: 4.16%  1 out of 24
    http_reqs......................: 24     1.385058/s

    EXECUTION
    iteration_duration.............: avg=787.47ms min=1.76ms   med=751.1ms  p(95)=1.26s    max=1.57s   
    iterations.....................: 24     1.385058/s
    vus............................: 1      min=1        max=2
    vus_max........................: 2      min=2        max=2

    NETWORK
    data_received..................: 41 kB  2.4 kB/s
    data_sent......................: 5.9 kB 340 B/s



running (0m17.3s), 0/2 VUs, 24 complete and 0 interrupted iterations
hit_probe ✓ [ 100% ] 1 VUs  0m17.3s/5m0s  23/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.6s/2m0s  1/1 shared iters